# Work Macbook

{{- if eq .location "work" }}
tap "homebrew/bundle"
brew "age"
brew "xz"
brew "autoconf"
brew "chezmoi"
brew "openssl@3"
brew "exa"
brew "exercism"
brew "fnm"
brew "fzf"
brew "gh"
brew "go"
brew "gource"
brew "helix"
brew "helm"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "kompose"
brew "krb5"
brew "neovim"
brew "nushell"
brew "python@3.11"
brew "pipx"
brew "pnpm", link: false
brew "postgresql@14"
brew "pyenv"
brew "tcl-tk"
brew "pypy3.10"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "skaffold"
brew "sops"
brew "starship", link: false
brew "stow"
brew "swiftformat"
brew "swiftlint"
brew "tree"
brew "wget"
brew "xclip"
brew "yadm"
brew "zellij"
cask "alacritty"
cask "docker"
cask "fig"
cask "rancher"
cask "wezterm"
{{- end }}

vscode "1YiB.rust-bundle"
vscode "allanoricil.nuxt-vscode-extension"
vscode "Alpha4.jsonl"
vscode "bierner.markdown-preview-github-styles"
vscode "bungcip.better-toml"
vscode "ClemensPeters.format-json"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "PKief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "trunk.io"
vscode "Vue.volar"
vscode "withfig.fig"
